app/views/meis/_form.html.erb

          <%= builder.label "Área de atuação" %><br>
          <%= builder.collection_select(:occupation_id, Occupation.all, :id, :area, prompt: true, class:'form-control') %>
---
SELECT "occupations".* FROM "occupations"