app/views/meis/index.html.erb

        <%= select_tag(:category, options_for_select([['Serviço', 1], ['Comércio', 2]], :selected => params[:category]), prompt: 'Todas as categorias', class: "form-control") %>
        <!-- < %= collection_select(:params, :category, Occupation.all, :id, :area, include_blank: true) %> -->
---
SELECT "occupations".* FROM "occupations"