app/controllers/home_controller.rb

  def index
     if params[:search]
        if [:category] == ""
          @meis = Mei.search(params[:search])
---
SELECT "meis".* FROM "meis" WHERE (nome LIKE '%pro%' OR descricao_atividade LIKE '%pro%')