app/controllers/meis_controller.rb

SELECT "meis".* FROM "meis" WHERE (nome LIKE '%desenvolvedor%' OR descricao_atividade LIKE '%desenvolvedor%')
SELECT "meis".* FROM "meis" INNER JOIN "acts" ON "acts"."mei_id" = "meis"."id" WHERE (nome LIKE '%desenvolvedor%' OR descricao_atividade LIKE '%desenvolvedor%' AND acts.occupation_id = '1')
---
  def index
    #caso a página de meis seja acessada sem passar parâmetros, é necessário mostrar todos os existentes
    #pode ser alterado lá na frente, quando for necessário filtrar por categorias, por exemplo
    @meis = Mei.all.paginate(:page => params[:page], :per_page => 4)

    if params[:search]
      if params[:search] == ""
          if params[:category] == ""
              if params[:job] == ""
                  @meis = Mei.all.paginate(:page => params[:page], :per_page => 4)
              else
                  @meis = Mei.search_with_job(params[:job]).paginate(:page => params[:page], :per_page => 4)

SELECT  "meis".* FROM "meis" WHERE "meis"."id" = ? LIMIT 1  [["id", 0]]
---
  def show

    @mei = Mei.find(params[:id])

INSERT INTO "meis" ("cnpj", "razao_social", "cpf", "rg", "nome", "sexo", "descricao_atividade", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @mei = Mei.new(mei_params)

    respond_to do |format|
      if @mei.save