app/controllers/meis_controller.rb

SELECT "comments".* FROM "comments"
---
  def show

    @mei = Mei.find(params[:id])
    @comments = Comment.where(mei_id: @mei.id)
    @comment = Comment.new(:mei_id => @mei.id) #deve ser alterado para esse --> @mei.comments.build


    @comments = Comment.all