app/views/layouts/_search_form.html.erb

        <%= text_field_tag :search, params[:search], class: "form-control", placeholder: "Pesquise"%>
        <%= select_tag(:category, options_from_collection_for_select(Occupation.all, :id, :area, :selected => params[:category]), prompt: 'Todas as categorias', class: "form-control") %>
---
SELECT "occupations".* FROM "occupations"